# Titanic Kaggle competition

Titanic datasets come from https://www.kaggle.com/c/titanic and is the most popular open kaggle competition.

It is my first real data set to practice data science skills. 

The work is done in jupyter and comes in stages:
1. Import and clean the data
2. feuture engineering to obtain new columns
3. basic statistics to recognize trends in data

Firstly I create environment by importing all neccesary packages.

In [2]:
import numpy as np
import pandas as pd

I saved files from website locally and read it from there.

In [166]:
train = 'C:\\Users\\Lenovo\\PycharmProjects\\Kaggle\\Project1_Titanic\\data\\train.csv'
test = 'C:\\Users\\Lenovo\\PycharmProjects\\Kaggle\\Project1_Titanic\\data\\test.csv'

train_data = pd.read_csv(train)
test_data = pd.read_csv(test)

## Kaggle Data description

In [193]:
pd.read_clipboard()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Variable</th>
      <th>Definition</th>
      <th>Key</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>survival</td>
      <td>Survival</td>
      <td>0 = No, 1 = Yes</td>
    </tr>
    <tr>
      <th>1</th>
      <td>pclass</td>
      <td>Ticket class</td>
      <td>1 = 1st, 2 = 2nd, 3 = 3rd</td>
    </tr>
    <tr>
      <th>2</th>
      <td>sex</td>
      <td>Sex</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Age</td>
      <td>Age in years</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>sibsp</td>
      <td># of siblings / spouses aboard the Titanic</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>5</th>
      <td>parch</td>
      <td># of parents / children aboard the Titanic</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>6</th>
      <td>ticket</td>
      <td>Ticket number</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>7</th>
      <td>fare</td>
      <td>Passenger fare</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>8</th>
      <td>cabin</td>
      <td>Cabin number</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>9</th>
      <td>embarked</td>
      <td>Port of Embarkation</td>
      <td>C = Cherbourg, Q = Queenstown, S = Southampton</td>
    </tr>
  </tbody>
</table>
</div>

### Train Data insights:
	1. 12 columns; 891 observations (Passengers)
	2. Each row is set to be different passenger.
	3. Null values: Age (177), Cabin (687), Embarked (2)
	4. Columns:
		4.1. PassengerId: Unique; int64
		4.2. Survived: [1, 0]; int64; 1:342 0:549
		4.3. Pclass: [1, 2, 3]; int64; 1:216 2:184 3:491
		4.4. Name: str; usually 'Surename, Title., Name(s)'
		4.5. Sex: ['female', 'male']; str; female:314 male: 577
		4.6. Age: float64; Year.0; min:0.42(under 1year decima; number) max:80
		4.7. SibSp: [0, 1, 2, 3, 4, 5, 8]; int64; 0:608 1:209 2:28 ...
		4.8. Parch: [0, 1, 2, 3, 4, 5, 6]; int64
		4.9. Ticket: str; possibly to del
		4.10. Fare: float64; min:0 max:512 mean:32
		4.11. Cabin: int64; maily 1st class (A##-E##); 147 obs; _possibly to del_
		4.12. Embarked: [C, Q, S]; possibly to del but S.survived = 217 S.notsurvived=417 maybe correlation with class

In [168]:
train_data.head(10)
#train_data.shape
#train_data.isnull().sum()
#train_data.dtypes
#train_data.PassengerId.is_unique
#train_data.groupby('Survived')['PassengerId'].count()
#train_data.groupby('Pclass')['PassengerId'].count()
#train_data.groupby('Sex')['PassengerId'].count()
#train_data.Age.describe(); train_data.sort_values('Age')
#train_data.groupby('SibSp')['PassengerId'].count()
#train_data.groupby('Parch')['PassengerId'].count()
#train_data.Fare.describe()
#train_data.groupby(['Pclass', 'Cabin'])['PassengerId'].count()
#train_data.groupby(['Embarked', 'Pclass'])['PassengerId'].count()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>0</td>
      <td>3</td>
      <td>Braund, Mr. Owen Harris</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>A/5 21171</td>
      <td>7.2500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>1</td>
      <td>1</td>
      <td>Cumings, Mrs. John Bradley (Florence Briggs Th...</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>PC 17599</td>
      <td>71.2833</td>
      <td>C85</td>
      <td>C</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>1</td>
      <td>3</td>
      <td>Heikkinen, Miss. Laina</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>STON/O2. 3101282</td>
      <td>7.9250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>1</td>
      <td>1</td>
      <td>Futrelle, Mrs. Jacques Heath (Lily May Peel)</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>113803</td>
      <td>53.1000</td>
      <td>C123</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>0</td>
      <td>3</td>
      <td>Allen, Mr. William Henry</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>373450</td>
      <td>8.0500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>5</th>
      <td>6</td>
      <td>0</td>
      <td>3</td>
      <td>Moran, Mr. James</td>
      <td>male</td>
      <td>NaN</td>
      <td>0</td>
      <td>0</td>
      <td>330877</td>
      <td>8.4583</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>6</th>
      <td>7</td>
      <td>0</td>
      <td>1</td>
      <td>McCarthy, Mr. Timothy J</td>
      <td>male</td>
      <td>54.0</td>
      <td>0</td>
      <td>0</td>
      <td>17463</td>
      <td>51.8625</td>
      <td>E46</td>
      <td>S</td>
    </tr>
    <tr>
      <th>7</th>
      <td>8</td>
      <td>0</td>
      <td>3</td>
      <td>Palsson, Master. Gosta Leonard</td>
      <td>male</td>
      <td>2.0</td>
      <td>3</td>
      <td>1</td>
      <td>349909</td>
      <td>21.0750</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>8</th>
      <td>9</td>
      <td>1</td>
      <td>3</td>
      <td>Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)</td>
      <td>female</td>
      <td>27.0</td>
      <td>0</td>
      <td>2</td>
      <td>347742</td>
      <td>11.1333</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>9</th>
      <td>10</td>
      <td>1</td>
      <td>2</td>
      <td>Nasser, Mrs. Nicholas (Adele Achem)</td>
      <td>female</td>
      <td>14.0</td>
      <td>1</td>
      <td>0</td>
      <td>237736</td>
      <td>30.0708</td>
      <td>NaN</td>
      <td>C</td>
    </tr>
  </tbody>
</table>
</div>

### Test Data:
	1. 11 columns; 418 observations (Passengers)
	2. Each row is set to be different passenger.
	3. Null values: Age (86), Cabin (327), Fare (1)

In [169]:
test_data.head(10)
#test_data.shape
#test_data.isnull().sum()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>892</td>
      <td>3</td>
      <td>Kelly, Mr. James</td>
      <td>male</td>
      <td>34.5</td>
      <td>0</td>
      <td>0</td>
      <td>330911</td>
      <td>7.8292</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>1</th>
      <td>893</td>
      <td>3</td>
      <td>Wilkes, Mrs. James (Ellen Needs)</td>
      <td>female</td>
      <td>47.0</td>
      <td>1</td>
      <td>0</td>
      <td>363272</td>
      <td>7.0000</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>2</th>
      <td>894</td>
      <td>2</td>
      <td>Myles, Mr. Thomas Francis</td>
      <td>male</td>
      <td>62.0</td>
      <td>0</td>
      <td>0</td>
      <td>240276</td>
      <td>9.6875</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>3</th>
      <td>895</td>
      <td>3</td>
      <td>Wirz, Mr. Albert</td>
      <td>male</td>
      <td>27.0</td>
      <td>0</td>
      <td>0</td>
      <td>315154</td>
      <td>8.6625</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>896</td>
      <td>3</td>
      <td>Hirvonen, Mrs. Alexander (Helga E Lindqvist)</td>
      <td>female</td>
      <td>22.0</td>
      <td>1</td>
      <td>1</td>
      <td>3101298</td>
      <td>12.2875</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>5</th>
      <td>897</td>
      <td>3</td>
      <td>Svensson, Mr. Johan Cervin</td>
      <td>male</td>
      <td>14.0</td>
      <td>0</td>
      <td>0</td>
      <td>7538</td>
      <td>9.2250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>6</th>
      <td>898</td>
      <td>3</td>
      <td>Connolly, Miss. Kate</td>
      <td>female</td>
      <td>30.0</td>
      <td>0</td>
      <td>0</td>
      <td>330972</td>
      <td>7.6292</td>
      <td>NaN</td>
      <td>Q</td>
    </tr>
    <tr>
      <th>7</th>
      <td>899</td>
      <td>2</td>
      <td>Caldwell, Mr. Albert Francis</td>
      <td>male</td>
      <td>26.0</td>
      <td>1</td>
      <td>1</td>
      <td>248738</td>
      <td>29.0000</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>8</th>
      <td>900</td>
      <td>3</td>
      <td>Abrahim, Mrs. Joseph (Sophie Halaut Easu)</td>
      <td>female</td>
      <td>18.0</td>
      <td>0</td>
      <td>0</td>
      <td>2657</td>
      <td>7.2292</td>
      <td>NaN</td>
      <td>C</td>
    </tr>
    <tr>
      <th>9</th>
      <td>901</td>
      <td>3</td>
      <td>Davies, Mr. John Samuel</td>
      <td>male</td>
      <td>21.0</td>
      <td>2</td>
      <td>0</td>
      <td>A/4 48871</td>
      <td>24.1500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

## Analyze Train set to test intuitive thoughts:
	1. Pclass has influence over Survived rate
	2. Sex --||--
	3. No of siblings --||--
	4. No of Parch --||--

In [170]:
print('-'*10, 'Number of Null Values for each dataset', '-'*10)
null_values = pd.concat([train_data.drop('Survived', axis=1).isnull().sum(), test_data.isnull().sum()], axis=1, keys=['Train', 'Test'])
null_values.query('Train !=0 | Test != 0')

---------- Number of Null Values for each dataset ----------

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Train</th>
      <th>Test</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Age</th>
      <td>177</td>
      <td>86</td>
    </tr>
    <tr>
      <th>Fare</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Cabin</th>
      <td>687</td>
      <td>327</td>
    </tr>
    <tr>
      <th>Embarked</th>
      <td>2</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
</div>

In [171]:
print('-'*10, 'Survival Rate per class', '-'*10)
train_data.groupby('Pclass')['Survived'].mean()

---------- Survival Rate per class ----------

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [172]:
print('-'*10, 'Survival Rate per Gender', '-'*10)
train_data.groupby('Sex')['Survived'].mean()

---------- Survival Rate per Gender ----------

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [173]:
print('-'*10, 'Survival Rate per No of Siblings/Spouse', '-'*10)
train_data.groupby('SibSp')['Survived'].mean()

---------- Survival Rate per No of Siblings/Spouse ----------

SibSp
0    0.345395
1    0.535885
2    0.464286
3    0.250000
4    0.166667
5    0.000000
8    0.000000
Name: Survived, dtype: float64

In [174]:
print('-'*10, 'Survival Rate per No of Parents/Children', '-'*10)
train_data.groupby('Parch')['Survived'].mean()

---------- Survival Rate per No of Parents/Children ----------

Parch
0    0.343658
1    0.550847
2    0.500000
3    0.600000
4    0.000000
5    0.200000
6    0.000000
Name: Survived, dtype: float64

## Clean Train and Test databases:
###	1. Fill Na:
	* Age = by calculating typical age range(mean +/- std) of this Sex and PClass as Higher class had much higher Age
	* Embarked = by the most common Embarked location
	* Fare = by median Fare value

In [175]:
print('-'*10, 'Start Train_data.Age filling', '-'*10)
age_stat = train_data.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'std'])

age_stat['start'] = age_stat['mean'] - age_stat['std']
age_stat['end'] = age_stat['mean'] + age_stat['std']
age_stat.drop(['mean', 'std'], axis=1, inplace=True)

train_data = pd.merge(train_data, age_stat, how='left', left_on=['Sex', 'Pclass'], right_index=True)
train_data['Age2'] = train_data.apply(lambda x: np.random.randint(x.start, x.end), axis=1)
train_data.Age.fillna(train_data.Age2, inplace=True)
train_data.drop(['start', 'end', 'Age2'], axis=1, inplace=True)

if train_data.Age.isnull().sum() == 0:
    print('-'*10, 'Cleaning Train_data.Age complete', '-'*10)
else:
    print('-'*10, 'Cleaning Train_data.Age complete but there are still Null values', '-'*10)

print('-'*10, 'Start Train_data.Age filling', '-'*10)
age_stat = test_data.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'std'])

age_stat['start'] = age_stat['mean'] - age_stat['std']
age_stat['end'] = age_stat['mean'] + age_stat['std']
age_stat.drop(['mean', 'std'], axis=1, inplace=True)

test_data = pd.merge(test_data, age_stat, how='left', left_on=['Sex', 'Pclass'], right_index=True)
test_data['Age2'] = test_data.apply(lambda x: np.random.randint(x.start, x.end), axis=1)
test_data.Age.fillna(test_data.Age2, inplace=True)
test_data.drop(['start', 'end', 'Age2'], axis=1, inplace=True)

if test_data.Age.isnull().sum() == 0:
    print('-'*10, 'Cleaning Test_data.Age complete', '-'*10)
else:
    print('-'*10, 'Cleaning Test_data.Age complete but there are still Null values', '-'*10)

---------- Start Train_data.Age filling ----------
---------- Cleaning Train_data.Age complete ----------
---------- Start Train_data.Age filling ----------

---------- Cleaning Test_data.Age complete ----------

In [186]:
print('-'*10, 'Cleaning Train.Embarkment', '-'*10)
train_data.Embarked.fillna(train_data.Embarked.mode()[0], inplace=True)
if train_data.Embarked.isnull().sum() == 0:
    print('-'*10, 'Cleaning train_data.Embarked complete', '-'*10)
else:
    print('-'*10, 'Cleaning train_data.Embarked complete but there are still Null values', '-'*10)

---------- Cleaning Train.Embarkment ----------
---------- Cleaning train_data.Embarked complete ----------

In [192]:
print('-'*10, 'Cleaning test_data.Fare', '-'*10)
test_data.Fare.fillna(test_data.Fare.median(), inplace=True)
if test_data.Fare.isnull().sum() == 0:
    print('-'*10, 'Cleaning test_data.Fare complete', '-'*10)
else:
    print('-'*10, 'Cleaning test_data.Fare complete but there are still Null values', '-'*10)

---------- Cleaning test_data.Fare ----------
---------- Cleaning test_data.Fare complete ----------

14.4542